In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import plotly as po
import plotly.express as px
import plotly.graph_objs as go

from counlist import countrylist

unemployment = pd.read_csv("..\\documentation\\unemployment_all_ratio.csv")


unemp = unemployment.loc[unemployment["Country"].isin(countrylist)]                              

unemp = unemp.loc[unemployment['Series'] == "Unemployment rate"]                                 
unemp = unemp[~unemp.Country.str.contains("Euro", na=False)]                                     
unemp = unemp[~unemp.Country.str.contains("OECD", na=False)]  

unemp = unemp.rename(columns={'SEX': 'Gender', 'Value':'Unemploy_Rate', "Time": "Year"})         
unemp = unemp[['Country', 'Gender', 'Age', 'Year', 'Unemploy_Rate']]                             

unemp.columns = [x.lower() for x in unemp.columns]                                               
unemp = unemp[unemp['year'] <= 2016]                                                                                      

unemp.drop(unemp[unemp.gender == 'MW'].index, inplace=True)                                                        
unemp.loc[unemp['gender'] == "MEN", 'gender'] = "male"                                           
unemp.loc[unemp['gender'] == "WOMEN", 'gender'] = "female"                                                     

unemp['age'] = unemp['age'].str.replace(' to ', '-')                                            


unemp = unemp[(unemp['age'] == '15-24') | (unemp['age'] == '25-34') |(unemp['age'] == '35-44') |(unemp['age'] == '45-54') | (unemp['age'] == '55-64') |(unemp['age'] == '65-69') | (unemp['age'] == '70-74')]

In [3]:
unemp.loc[(unemp["age"] == '35-44') | (unemp["age"] == '45-54'), 'age'] = '35-54'                                   
unemp.loc[(unemp["age"] == '55-64') | (unemp["age"] == '65-69') | (unemp["age"] == '70-74'), 'age'] = "55-74"

In [4]:
aggregation_functions = {'unemploy_rate': 'mean'}

In [5]:
unemp_ages_mean = unemp.groupby('age').aggregate(aggregation_functions).sort_values("unemploy_rate", ascending=False).round(2)
unemp_ages_mean

       unemploy_rate
age
15-24          18.68
25-34           9.07
35-54           6.37
55-74           3.06

In [6]:
unemp_countries_mean = unemp.groupby('country').aggregate(aggregation_functions).sort_values("unemploy_rate", ascending=False).round(2)
unemp_countries_mean

                    unemploy_rate
country
South Africa                21.29
Spain                       13.78
Greece                      13.37
Croatia                     11.40
Poland                      10.82
Bulgaria                    10.46
Latvia                      10.28
Lithuania                    9.75
Colombia                     9.64
Italy                        9.07
Estonia                      8.42
Portugal                     8.29
Chile                        7.91
Russian Federation           7.74
Finland                      7.73
France                       7.66
Israel                       7.38
Turkey                       7.14
Brazil                       7.05
Hungary                      6.90
Belgium                      6.83
Cyprus                       6.59
Czech Republic               6.45
Sweden                       6.39
Costa Rica                   6.24
Ireland                      6.20
Canada                       6.19
Romania                      6.03
United Kingdom               6.03
Germany                      5.89
Slovenia                     5.79
Malta                        4.96
Australia                    4.96
Netherlands                  4.77
Luxembourg                   4.59
New Zealand                  4.39
Denmark                      4.37
Japan                        4.20
Iceland                      3.93
Austria                      3.86
Switzerland                  3.40
Norway                       3.09
Mexico                       3.07

In [7]:
most_unemp = unemp_countries_mean.sort_values("unemploy_rate", ascending=False).round(2).head(5)
least_unemp = unemp_countries_mean.sort_values("unemploy_rate", ascending=False).round(2).tail(5)

In [8]:
print(most_unemp)
print(least_unemp)

              unemploy_rate
country
South Africa          21.29
Spain                 13.78
Greece                13.37
Croatia               11.40
Poland                10.82
             unemploy_rate
country
Iceland               3.93
Austria               3.86
Switzerland           3.40
Norway                3.09
Mexico                3.07

In [9]:
unemp_pivot_mean_gndr = pd.pivot_table(unemp, index = ['country', 'year', 'gender'], values = ['unemploy_rate']).round(2)
unemp_pivot_mean_gndr

                            unemploy_rate
country        year gender
Australia      2000 female           4.99
                    male             5.87
               2001 female           5.35
                    male             6.40
               2002 female           5.16
...                                   ...
United Kingdom 2014 male             6.75
               2015 female           4.97
                    male             5.58
               2016 female           4.71
                    male             5.17

[1448 rows x 1 columns]

In [10]:
unemp_pivot_mean = pd.pivot_table(unemp, index = ['country', 'year'], values = ['unemploy_rate']).round(2)
unemp_pivot_mean

                     unemploy_rate
country        year
Australia      2000           5.43
               2001           5.88
               2002           5.51
               2003           5.15
               2004           4.78
...                            ...
United Kingdom 2012           7.72
               2013           7.41
               2014           6.29
               2015           5.27
               2016           4.94

[724 rows x 1 columns]

In [11]:
sp_un = unemp_pivot_mean_gndr.loc["Spain"]                   #unemployment evolution in Spain per gender : tendency is to equal
sp_un

             unemploy_rate
year gender
2000 female          15.31
     male             8.64
2001 female          11.21
     male             6.74
2002 female          11.88
     male             6.83
2003 female          12.13
     male             7.04
2004 female          11.34
     male             6.84
2005 female          10.02
     male             6.17
2006 female           9.15
     male             5.49
2007 female           8.84
     male             5.50
2008 female          10.85
     male             8.31
2009 female          14.87
     male            14.61
2010 female          15.99
     male            16.75
2011 female          17.92
     male            18.05
2012 female          21.23
     male            21.03
2013 female          22.90
     male            22.53
2014 female          22.12
     male            21.33
2015 female          20.03
     male            19.00
2016 female          19.16
     male            17.09

In [12]:
nw_un = unemp_pivot_mean.loc["Norway"]
nw_un

      unemploy_rate
year
2000           3.57
2001           3.53
2002           3.15
2003           3.58
2004           3.46
2005           3.67
2006           2.94
2007           2.21
2008           2.12
2009           2.91
2010           3.04
2011           2.73
2012           2.59
2013           2.83
2014           2.86
2015           3.50
2016           3.89

In [13]:
sa_un = unemp_pivot_mean.loc["South Africa"]
sa_un

      unemploy_rate
year
2001          22.99
2002          24.65
2003          24.74
2004          22.58
2005          21.89
2006          20.64
2007          20.59
2008          18.43
2009          19.37
2010          20.39
2011          20.22
2012          20.63
2013          20.66
2014          20.90
2015          21.24
2016          22.27

In [14]:
unemp_age_group = unemp.groupby(['gender']).mean().round(2)
unemp_age_group

           year  unemploy_rate
gender
female  2008.12           7.44
male    2008.10           7.02